ModuleList(
  (0): CNN(
    (conv): Conv2d(3, 32, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
    (batch): BatchNorm2d(32, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
    (activation): SiLU()
  )
  (1): CNN(
    (conv): Conv2d(32, 64, kernel_size=(3, 3), stride=(1, 1), padding=(2, 2))
    (batch): BatchNorm2d(64, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
    (activation): SiLU()
  )
  (2): Residual(
    (layers): ModuleList(
      (0): Sequential(
        (0): CNN(
          (conv): Conv2d(64, 128, kernel_size=(1, 1), stride=(1, 1))
          (batch): BatchNorm2d(128, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
          (activation): SiLU()
        )
        (1): CNN(
          (conv): Conv2d(128, 64, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
          (batch): BatchNorm2d(64, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
          (activation): SiLU()
        )
      )
    )
  )
  (3): CNN(
    (conv): Conv2d(64, 128, kernel_size=(3, 3), stride=(1, 1), padding=(2, 2))
    (batch): BatchNorm2d(128, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
    (activation): SiLU()
  )
  (4): Residual(
    (layers): ModuleList(
      (0): Sequential(
        (0): CNN(
          (conv): Conv2d(128, 256, kernel_size=(1, 1), stride=(1, 1))
          (batch): BatchNorm2d(256, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
          (activation): SiLU()
        )
        (1): CNN(
          (conv): Conv2d(256, 128, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
          (batch): BatchNorm2d(128, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
          (activation): SiLU()
        )
      )
      (1): Sequential(
        (0): CNN(
          (conv): Conv2d(128, 256, kernel_size=(1, 1), stride=(1, 1))
          (batch): BatchNorm2d(256, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
          (activation): SiLU()
        )
        (1): CNN(
          (conv): Conv2d(256, 128, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
          (batch): BatchNorm2d(128, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
          (activation): SiLU()
        )
      )
    )
  )
  (5): CNN(
    (conv): Conv2d(128, 256, kernel_size=(3, 3), stride=(1, 1), padding=(2, 2))
    (batch): BatchNorm2d(256, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
    (activation): SiLU()
  )
  (6): Residual(
    (layers): ModuleList(
      (0): Sequential(
        (0): CNN(
          (conv): Conv2d(256, 512, kernel_size=(1, 1), stride=(1, 1))
          (batch): BatchNorm2d(512, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
          (activation): SiLU()
        )
        (1): CNN(
          (conv): Conv2d(512, 256, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
          (batch): BatchNorm2d(256, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
          (activation): SiLU()
        )
      )
      (1): Sequential(
        (0): CNN(
          (conv): Conv2d(256, 512, kernel_size=(1, 1), stride=(1, 1))
          (batch): BatchNorm2d(512, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
          (activation): SiLU()
        )
        (1): CNN(
          (conv): Conv2d(512, 256, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
          (batch): BatchNorm2d(256, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
          (activation): SiLU()
        )
      )
      (2): Sequential(
        (0): CNN(
          (conv): Conv2d(256, 512, kernel_size=(1, 1), stride=(1, 1))
          (batch): BatchNorm2d(512, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
          (activation): SiLU()
        )
        (1): CNN(
          (conv): Conv2d(512, 256, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
          (batch): BatchNorm2d(256, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
          (activation): SiLU()
        )
      )
      (3): Sequential(
        (0): CNN(
          (conv): Conv2d(256, 512, kernel_size=(1, 1), stride=(1, 1))
          (batch): BatchNorm2d(512, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
          (activation): SiLU()
        )
        (1): CNN(
          (conv): Conv2d(512, 256, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
          (batch): BatchNorm2d(256, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
          (activation): SiLU()
        )
      )
      (4): Sequential(
        (0): CNN(
          (conv): Conv2d(256, 512, kernel_size=(1, 1), stride=(1, 1))
          (batch): BatchNorm2d(512, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
          (activation): SiLU()
        )
        (1): CNN(
          (conv): Conv2d(512, 256, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
          (batch): BatchNorm2d(256, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
          (activation): SiLU()
        )
      )
      (5): Sequential(
        (0): CNN(
          (conv): Conv2d(256, 512, kernel_size=(1, 1), stride=(1, 1))
          (batch): BatchNorm2d(512, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
          (activation): SiLU()
        )
        (1): CNN(
          (conv): Conv2d(512, 256, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
          (batch): BatchNorm2d(256, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
          (activation): SiLU()
        )
      )
      (6): Sequential(
        (0): CNN(
          (conv): Conv2d(256, 512, kernel_size=(1, 1), stride=(1, 1))
          (batch): BatchNorm2d(512, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
          (activation): SiLU()
        )
        (1): CNN(
          (conv): Conv2d(512, 256, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
          (batch): BatchNorm2d(256, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
          (activation): SiLU()
        )
      )
      (7): Sequential(
        (0): CNN(
          (conv): Conv2d(256, 512, kernel_size=(1, 1), stride=(1, 1))
          (batch): BatchNorm2d(512, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
          (activation): SiLU()
        )
        (1): CNN(
          (conv): Conv2d(512, 256, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
          (batch): BatchNorm2d(256, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
          (activation): SiLU()
        )
      )
    )
  )
  (7): CNN(
    (conv): Conv2d(256, 512, kernel_size=(3, 3), stride=(1, 1), padding=(2, 2))
    (batch): BatchNorm2d(512, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
    (activation): SiLU()
  )
  (8): Residual(
    (layers): ModuleList(
      (0): Sequential(
        (0): CNN(
          (conv): Conv2d(512, 1024, kernel_size=(1, 1), stride=(1, 1))
          (batch): BatchNorm2d(1024, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
          (activation): SiLU()
        )
        (1): CNN(
          (conv): Conv2d(1024, 512, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
          (batch): BatchNorm2d(512, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
          (activation): SiLU()
        )
      )
      (1): Sequential(
        (0): CNN(
          (conv): Conv2d(512, 1024, kernel_size=(1, 1), stride=(1, 1))
          (batch): BatchNorm2d(1024, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
          (activation): SiLU()
        )
        (1): CNN(
          (conv): Conv2d(1024, 512, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
          (batch): BatchNorm2d(512, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
          (activation): SiLU()
        )
      )
      (2): Sequential(
        (0): CNN(
          (conv): Conv2d(512, 1024, kernel_size=(1, 1), stride=(1, 1))
          (batch): BatchNorm2d(1024, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
          (activation): SiLU()
        )
        (1): CNN(
          (conv): Conv2d(1024, 512, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
          (batch): BatchNorm2d(512, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
          (activation): SiLU()
        )
      )
      (3): Sequential(
        (0): CNN(
          (conv): Conv2d(512, 1024, kernel_size=(1, 1), stride=(1, 1))
          (batch): BatchNorm2d(1024, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
          (activation): SiLU()
        )
        (1): CNN(
          (conv): Conv2d(1024, 512, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
          (batch): BatchNorm2d(512, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
          (activation): SiLU()
        )
      )
      (4): Sequential(
        (0): CNN(
          (conv): Conv2d(512, 1024, kernel_size=(1, 1), stride=(1, 1))
          (batch): BatchNorm2d(1024, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
          (activation): SiLU()
        )
        (1): CNN(
          (conv): Conv2d(1024, 512, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
          (batch): BatchNorm2d(512, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
          (activation): SiLU()
        )
      )
      (5): Sequential(
        (0): CNN(
          (conv): Conv2d(512, 1024, kernel_size=(1, 1), stride=(1, 1))
          (batch): BatchNorm2d(1024, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
          (activation): SiLU()
        )
        (1): CNN(
          (conv): Conv2d(1024, 512, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
          (batch): BatchNorm2d(512, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
          (activation): SiLU()
        )
      )
      (6): Sequential(
        (0): CNN(
          (conv): Conv2d(512, 1024, kernel_size=(1, 1), stride=(1, 1))
          (batch): BatchNorm2d(1024, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
          (activation): SiLU()
        )
        (1): CNN(
          (conv): Conv2d(1024, 512, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
          (batch): BatchNorm2d(512, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
          (activation): SiLU()
        )
      )
      (7): Sequential(
        (0): CNN(
          (conv): Conv2d(512, 1024, kernel_size=(1, 1), stride=(1, 1))
          (batch): BatchNorm2d(1024, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
          (activation): SiLU()
        )
        (1): CNN(
          (conv): Conv2d(1024, 512, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
          (batch): BatchNorm2d(512, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
          (activation): SiLU()
        )
      )
    )
  )
  (9): Residual(
    (layers): ModuleList(
      (0): Sequential(
        (0): CNN(
          (conv): Conv2d(512, 1024, kernel_size=(1, 1), stride=(1, 1))
          (batch): BatchNorm2d(1024, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
          (activation): SiLU()
        )
        (1): CNN(
          (conv): Conv2d(1024, 512, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
          (batch): BatchNorm2d(512, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
          (activation): SiLU()
        )
      )
      (1): Sequential(
        (0): CNN(
          (conv): Conv2d(512, 1024, kernel_size=(1, 1), stride=(1, 1))
          (batch): BatchNorm2d(1024, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
          (activation): SiLU()
        )
        (1): CNN(
          (conv): Conv2d(1024, 512, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
          (batch): BatchNorm2d(512, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
          (activation): SiLU()
        )
      )
      (2): Sequential(
        (0): CNN(
          (conv): Conv2d(512, 1024, kernel_size=(1, 1), stride=(1, 1))
          (batch): BatchNorm2d(1024, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
          (activation): SiLU()
        )
        (1): CNN(
          (conv): Conv2d(1024, 512, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
          (batch): BatchNorm2d(512, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
          (activation): SiLU()
        )
      )
      (3): Sequential(
        (0): CNN(
          (conv): Conv2d(512, 1024, kernel_size=(1, 1), stride=(1, 1))
          (batch): BatchNorm2d(1024, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
          (activation): SiLU()
        )
        (1): CNN(
          (conv): Conv2d(1024, 512, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
          (batch): BatchNorm2d(512, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
          (activation): SiLU()
        )
      )
    )
  )
  (10): CNN(
    (conv): Conv2d(512, 512, kernel_size=(1, 1), stride=(1, 1), padding=(1, 1))
    (batch): BatchNorm2d(512, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
    (activation): SiLU()
  )
  (11): Sequential(
    (0): Residual(
      (layers): ModuleList(
        (0): Sequential(
          (0): CNN(
            (conv): Conv2d(512, 1024, kernel_size=(1, 1), stride=(1, 1))
            (batch): BatchNorm2d(1024, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
            (activation): SiLU()
          )
          (1): CNN(
            (conv): Conv2d(1024, 512, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
            (batch): BatchNorm2d(512, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
            (activation): SiLU()
          )
        )
      )
    )
    (1): CNN(
      (conv): Conv2d(512, 256, kernel_size=(1, 1), stride=(1, 1))
      (batch): BatchNorm2d(256, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (activation): SiLU()
    )
    (2): ScalePrediction(
      (pred): Sequential(
        (0): CNN(
          (conv): Conv2d(256, 512, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
          (batch): BatchNorm2d(512, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
          (activation): SiLU()
        )
        (1): CNN(
          (conv): Conv2d(512, 21, kernel_size=(1, 1), stride=(1, 1), bias=False)
          (batch): BatchNorm2d(21, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
          (activation): Identity()
        )
      )
    )
  )
  (12): CNN(
    (conv): Conv2d(256, 256, kernel_size=(1, 1), stride=(1, 1), padding=(1, 1))
    (batch): BatchNorm2d(256, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
    (activation): SiLU()
  )
  (13): Upsample(scale_factor=2.0, mode=nearest)
  (14): CNN(
    (conv): Conv2d(768, 256, kernel_size=(1, 1), stride=(1, 1), padding=(1, 1))
    (batch): BatchNorm2d(256, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
    (activation): SiLU()
  )
  (15): CNN(
    (conv): Conv2d(256, 512, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
    (batch): BatchNorm2d(512, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
    (activation): SiLU()
  )
  (16): Sequential(
    (0): Residual(
      (layers): ModuleList(
        (0): Sequential(
          (0): CNN(
            (conv): Conv2d(512, 1024, kernel_size=(1, 1), stride=(1, 1))
            (batch): BatchNorm2d(1024, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
            (activation): SiLU()
          )
          (1): CNN(
            (conv): Conv2d(1024, 512, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
            (batch): BatchNorm2d(512, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
            (activation): SiLU()
          )
        )
      )
    )
    (1): CNN(
      (conv): Conv2d(512, 256, kernel_size=(1, 1), stride=(1, 1))
      (batch): BatchNorm2d(256, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (activation): SiLU()
    )
    (2): ScalePrediction(
      (pred): Sequential(
        (0): CNN(
          (conv): Conv2d(256, 512, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
          (batch): BatchNorm2d(512, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
          (activation): SiLU()
        )
        (1): CNN(
          (conv): Conv2d(512, 21, kernel_size=(1, 1), stride=(1, 1), bias=False)
          (batch): BatchNorm2d(21, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
          (activation): Identity()
        )
      )
    )
  )
  (17): CNN(
    (conv): Conv2d(256, 128, kernel_size=(1, 1), stride=(1, 1), padding=(1, 1))
    (batch): BatchNorm2d(128, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
    (activation): SiLU()
  )
  (18): Upsample(scale_factor=2.0, mode=nearest)
  (19): CNN(
    (conv): Conv2d(384, 128, kernel_size=(1, 1), stride=(1, 1), padding=(1, 1))
    (batch): BatchNorm2d(128, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
    (activation): SiLU()
  )
  (20): CNN(
    (conv): Conv2d(128, 256, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
    (batch): BatchNorm2d(256, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
    (activation): SiLU()
  )
  (21): Sequential(
    (0): Residual(
      (layers): ModuleList(
        (0): Sequential(
          (0): CNN(
            (conv): Conv2d(256, 512, kernel_size=(1, 1), stride=(1, 1))
            (batch): BatchNorm2d(512, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
            (activation): SiLU()
          )
          (1): CNN(
            (conv): Conv2d(512, 256, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
            (batch): BatchNorm2d(256, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
            (activation): SiLU()
          )
        )
      )
    )
    (1): CNN(
      (conv): Conv2d(256, 128, kernel_size=(1, 1), stride=(1, 1))
      (batch): BatchNorm2d(128, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (activation): SiLU()
    )
    (2): ScalePrediction(
      (pred): Sequential(
        (0): CNN(
          (conv): Conv2d(128, 256, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
          (batch): BatchNorm2d(256, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
          (activation): SiLU()
        )
        (1): CNN(
          (conv): Conv2d(256, 21, kernel_size=(1, 1), stride=(1, 1), bias=False)
          (batch): BatchNorm2d(21, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
          (activation): Identity()
        )
      )
    )
  )
)